In [1]:
import pandas as pd

In [2]:
file_path = "Employees.csv"

In [3]:
df = pd.read_csv(file_path)

In [4]:
df

    Name  Gender      Age  Salary(USD)
0    Mark      M  20.3650         1000
1   John       M  60.3226         1200
2  Edward      M  42.2650         3000
3   Salah      M  31.3800         5000
4   Ahmed      M  42.6800         1700
5    Sara      F  25.3640         1900
6   Julia      F  21.2857         1950
7   John       M  60.3226         1200
8    Mark      M  20.3650         1000

In [5]:
df.shape

(9, 4)

In [6]:
df.drop_duplicates(inplace=True)

In [7]:
df.shape

(7, 4)

In [8]:
df['Age'] = df['Age'].astype(int)

In [9]:
df

    Name  Gender  Age  Salary(USD)
0    Mark      M   20         1000
1   John       M   60         1200
2  Edward      M   42         3000
3   Salah      M   31         5000
4   Ahmed      M   42         1700
5    Sara      F   25         1900
6   Julia      F   21         1950

In [10]:
df['Salary(EGP)'] = df['Salary(USD)'] * 48.31 # 1 USD = 48.31 EGP

In [11]:
df

    Name  Gender  Age  Salary(USD)  Salary(EGP)
0    Mark      M   20         1000      48310.0
1   John       M   60         1200      57972.0
2  Edward      M   42         3000     144930.0
3   Salah      M   31         5000     241550.0
4   Ahmed      M   42         1700      82127.0
5    Sara      F   25         1900      91789.0
6   Julia      F   21         1950      94204.5

In [12]:
ages_mean = df['Age'].mean()
ages_mean

34.42857142857143

In [13]:
usd_median = df['Salary(USD)'].median()
egp_median = df['Salary(EGP)'].median()
usd_median, egp_median

(1900.0, 91789.0)

In [14]:
gender_count = df['Gender'].value_counts()
gender_count

Gender
M    5
F    2
Name: count, dtype: int64

In [15]:
df.to_csv(f"clean_{file_path}", index=False)